app/views/users/show.html.erb

SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 3
---

				<h3> You are following <%= pluralize(current_user.follows.count, "event")%>