app/views/events/_event.html.erb


		<small> by <% user = event.user rescue User.find(event.user_id) %> <%= user.name%> </small>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]