app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = 1 LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 3
---
  def show
  	@user = User.find(params[:id])
    #@create_task = Task.new
    @events = @user.events.paginate(:page => params[:page]) unless @user.events.empty?

SELECT "users".* FROM "users"
---
  def index
@title = "All users"
@users = User.all

INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
def create
@user = User.new(params[:user])
if @user.save